package Module1;

public class Task2 {
    //2. Найдите значение функции: с = 3 + а
    public static void main(String[] args) {
        double a = 65;
        double c;
        c = 3 + a;
        System.out.println("Значение функции" + " " + c );


       /* double d = 49;
        double a;
         a = Math.pow(d,4); точка вызова
         a = d + Math.sqrt(d);  вычисление корня квадратного  */
    }
}