package Module1;

public class Task07 {
    //7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
    public  static void main(String [] args) {
        //Scanner scan = new Scanner();
       // double length = ScannerDouble;
       // System.out.println(scan);
        double length = 8;
       double width = length / 2;
        double S = length * width;

        System.out.println("При width = " + width  + " length = " + length + " S = " + S );

    }
}
