package com.linear.tasks;

public class Task2 {
    //2. Найдите значение функции: с = 3 + а
    public static void main(String[] args) {
        int a = 65;
        int c = 3 + a;
        System.out.println("Значение функции" + " " + c);
    }
}